app/Controllers/Buku.php

SELECT `books`.*, `penulis`.`nama_penulis`
FROM `books`
JOIN `penulis` ON `penulis`.`id_penulis` = `books`.`id_penulis`
---
    public function index()
    {
        // "buku.*" diganti jadi "books.*" sesuai nama tabel database kamu
        $data['buku'] = $this->bukuModel->select('books.*, penulis.nama_penulis')
                         ->join('penulis', 'penulis.id_penulis = books.id_penulis')
                         ->findAll();