app/Controllers/Peminjaman.php

    public function create() {
    $UsersModel = new \App\Models\UsersModel(); // Sesuaikan nama model user kamu
    $BukuModel = new \App\Models\BukuModel();

    $data = [
        'title'  => 'Tambah Peminjaman',
        'users'  => $UsersModel->findAll(),
        'books'   => $BukuModel->where('stok >', 0)->findAll() // Hanya buku yang ada stoknya
---
SELECT *
FROM `users`
SELECT *
FROM `books`
WHERE `stok` > 0

    public function store() {
        $model = new PeminjamanModel();
        $bukuModel = new \App\Models\BukuModel();

        $id_buku = $this->request->getPost('id_buku');

        // Simpan transaksi
        $model->save([
            'id_user' => $this->request->getPost('id_user'),
            'id_buku' => $id_buku,
            'tgl_pinjam' => $this->request->getPost('tgl_pinjam'),
            'tgl_kembali' => $this->request->getPost('tgl_kembali'),
            'status' => 'dipinjam'
        ]);
---
INSERT INTO `peminjaman` (`id_user`, `id_buku`, `tgl_pinjam`, `tgl_kembali`, `status`) VALUES ('3', '1', '2026-04-28', '2026-05-05', 'dipinjam')