app/Models/PeminjamanModel.php

    public function getPeminjaman() {
        return $this->select('peminjaman.*, users.nama, books.judul')
                    ->join('users', 'users.id_user = peminjaman.id_user')
                    ->join('books', 'books.id_buku = peminjaman.id_buku')
                    ->findAll();
---
SELECT `peminjaman`.*, `users`.`nama`, `books`.`judul`
FROM `peminjaman`
JOIN `users` ON `users`.`id_user` = `peminjaman`.`id_user`
JOIN `books` ON `books`.`id_buku` = `peminjaman`.`id_buku`